app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?)  [["text", "ssss"], ["created_at", "2020-05-07 11:25:42.907885"], ["updated_at", "2020-05-07 11:25:42.907885"], ["post_id", 1]]
---
  def create
  #   @comment = Comment.new(comment_params)


  #   if @comment.save
  #     render json: @comment, status: :created, location: @comment
  #   else
  #     render json: @comment.errors, status: :unprocessable_entity
  #   end

    @comment = Comment.create(comment_params)