app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)

    if @photo.save
---
INSERT INTO "photos" ("img", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?)