app/controllers/plants_controller.rb

INSERT INTO "plants" ("common_name", "latin_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["common_name", "Baker"], ["latin_name", "Plant"], ["created_at", "2020-05-08 02:52:12.360915"], ["updated_at", "2020-05-08 02:52:12.360915"]]
---
  def create
    # @plant = Plant.new(plant_params)
    # if @plant.save
    #   render json: @plant, status: :created, location: @plant
    # else
    #   render json: @plant.errors, status: :unprocessable_entity
    # end
    @plant = Plant.create(plant_params)