app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "plant_id", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?)  [["user_id", 11], ["plant_id", 15], ["created_at", "2020-05-08 03:05:41.091807"], ["updated_at", "2020-05-08 03:05:41.091807"], ["description", "Hes the best"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save